Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/groovy2-68-ru-omegat.tmx
Source language: en_us
Languages: ru

source: Groovy Editor
ru: Редактор Groovy

source: Support for editing Groovy files
ru: Поддержка редактирования файлов Groovy

source: Groovy Files
ru: Файлы Groovy

source: Groovy Quoted Strings
ru: Строки Groovy в двойных кавычках

source: Groovy Strings
ru: Строки Groovy в одинарных кавычках

source: Groovy Comments
ru: Комментарии Groovy

source: Reformat Paragraph
ru: Переформатировать параграф

source: Cannot rename this symbol; only parameters, local and dynamic variables are allowed
ru: Невозможно переименовать этот символ; можно переименовывать только параметры, локальные и динамические переменные

source: Cannot rename when source contains errors
ru: Переименование невозможно, если источник содержит ошибки

source: Syntax error, unexpected {0}
ru: Ошибка синтаксиса, неожиданный символ {0}

source: Only a-z, A-Z, digits and underscore are safe in Groovy names
ru: Только символы a-z, A-Z, цифры и знак подчеркивания допустимы в именах Groovy

source: Error
ru: Ошибка

source: Class Variable
ru: Переменная класса

source: Regular Expression
ru: Регулярное выражение

source: Line Comment
ru: Строчный комментарий

source: Constant
ru: Константа

source: Number
ru: Число

source: Identifier
ru: Идентификатор

source: Keyword
ru: Ключевое слово

source: Whitespace
ru: Пробел

source: Floating point number
ru: Число с плавающей точкой

source: Operator
ru: Оператор

source: Instance
ru: Экземпляр

source: Invalid String
ru: Неверная строка

source: Global Variable
ru: Глобальная переменная

source: Todo Item
ru: Задача (элемент TODO)

source: String
ru: Строка

source: Block Comment
ru: Многострочный комментарий

source: Quoted String
ru: Строка в кавычках

source: String Escape
ru: Последовательность спецсимволов

source: Character Literal
ru: Литерал символа

source: Documentation
ru: Документация

source: Comment Text
ru: Текст комментария

source: Comment TODO Text
ru: Текст комментария TODO

source: RDoc Comment Tag
ru: Тег комментария RDoc

source: Comment HTML Tag
ru: Тег комментария HTML

source: Comment Link
ru: Ссылка комментария

source: Bold Comment
ru: Полужирный комментарий

source: Italic Comment
ru: Наклонный комментарий

source: Type Symbol
ru: Символ типа

source: Regular Expression Metachar
ru: Метасимвол регулярного выражения

source: Invalid Regular Expression
ru: Неверное регулярное выражение

source: Unused Element
ru: Неиспользуемый элемент

source: Abstract Element
ru: Абстрактный элемент

source: Field
ru: Поле

source: Local Variable
ru: Локальная переменная

source: Parameter
ru: Параметр

source: Method
ru: Метод

source: Constructor
ru: Конструктор

source: Class
ru: Класс

source: Interface
ru: Интерфейс

source: Annotation
ru: Аннотация

source: Enum
ru: Перечисление

source: Deprecated Element
ru: Нерекомендуемый элемент

source: Static Member
ru: Статический член

source: Private Member
ru: Приватный член

source: Package Private Member
ru: Частный член пакета

source: Protected Member
ru: Защищенный член

source: Public Member
ru: Публичный член

source: Type Parameter
ru: Параметр типа

source: Type Parameter Use
ru: Использование параметра типа

source: Undefined Element
ru: Неопределённый элемент

source: Mark Occurrences
ru: Отметить вхождения

source: import Java class
ru: импорт класса Java

source: Create Several Columns
ru: Создать несколько столбцов

source: Add Column
ru: Добавить столбец

source: Create Table
ru: Создать таблицу

source: This method is generated dynamically by Rails, and will search your model for matches of the given column.
ru: Данный метод динамически создаётся Rails, и выполняет поиск выбранного столбца в модели.

source: You can also search by combinations of columns by concatenating them with <code>_and_</code>.
ru: Также можно выполнять поиск по нескольким столбцам, объединяя их <code>_and_</code>.

source: No comment found
ru: Комментариев не найдено

source: (documented)
ru: (документировано)

source: (:nodoc:)
ru: (:недокументировано:)

source: in
ru: в

source: The file cannot be found.
ru: Файл не найден.

source: Perhaps it has been deleted outside the IDE?
ru: Возможно он был удалён вне среды?

source: You can force an update of the index by removing the var/cache/gsf-index directory in your user directory.
ru: Вы можете выполнить принудительное обновление индекса, удалив каталог var/cache/gsf-index из пользовательского каталога.

source: We only rename Variables at the moment
ru: В настоящее время поддерживается переименование только переменных

source: Fix Imports
ru: Исправить выражения импорта

source: Fix all Imports
ru: Исправить все выражения импорта

source: Choose appropriate fully qualified name
ru: Выберите одно из подходящих полных имён

source: Fully Qualified Names
ru: Полные имена

source: <nothing to fix>
ru: <нечего исправлять>

source: <html>Select the fully qualified name to use in the import statement.</html>
ru: <html>Выделите полное имя для использования в выражении импорта.</html>

source: Import Statements:
ru: Выражения импорта:

source: Unable to find the doc for JDK/GDK.<br>You can configure GDK 1.6.4 doc folder in Tools/Options/Miscellaneous/Groovy.
ru: Невозможно найти документацию JDK/GDK.<br>Настройте расположение документации GDK 1.6.4 в меню Сервис | Инструменты, на вкладке Различное | Groovy.

source: Surround with ...
ru: Окружить...

source: Surround with /*selection*/
ru: Окружить /* комментарием */

source: Surround with if (exp) {...|}
ru: Окружить выражением if (exp) {...|}

source: Fix all imports ...
ru: Исправить все выражения импорта...

source: Add import for
ru: Добавить импорт для

source: Quoted String Literal
ru: Строковый литерал с двойными кавычками

source: Starting of Grails failed, check whether the {0} script is executable.
ru: Не удалось запустить Grails, проверьте выполним ли скрипт {0}.

source: Interface to Grails platform
ru: Интерфейс для платформы Grails

source: Grails Platform
ru: Платформа Grails

source: Unknown Ver.
ru: Неизвестная версия

source: {0} on {1}
ru: {0} на {1}

source: Stop
ru: Остановить

source: Grails runtime settings
ru: Параметры выполнения Grails

source: Get Grails at
ru: Загрузите Grails с сайта

source: Grails &Home:
ru: Папка &установки Grails:

source: Bro&wse...
ru: Об&зор...

source: Browse
ru: Обзор

source: Browse for Grails
ru: Выбор папки Grails

source: Grails Home
ru: Папка установки Grails

source: Location of Grails Home
ru: Папка установки Grails

source: Select Directory
ru: Выбор папки

source: This directory does not seem to be the Grails home directory
ru: Данная папка не является папкой, в которую установлен Grails

source: Generate...
ru: Создать...

source: Configuration
ru: Конфигурация

source: Controllers
ru: Контроллеры

source: Domain Classes
ru: Доменные классы

source: Message Bundles
ru: Наборы сообщений

source: Services
ru: Сервисы

source: Tag Libraries
ru: Библиотеки тегов

source: Utility Classes
ru: Служебные классы

source: Views and Layouts
ru: Представления и макеты

source: Web Application
ru: Веб-приложение

source: Libraries
ru: Библиотеки

source: Integration Tests
ru: Интеграционные тесты

source: Unit Tests
ru: Модульные тесты

source: {0} Tests
ru: {0} тестов

source: Java Source Packages
ru: Исходные файлы Java

source: GWT Source Packages
ru: Исходные файлы GWT

source: Groovy Source Packages
ru: Исходные файлы Groovy

source: Plugins
ru: Плагины

source: Scripts
ru: Скрипты

source: Cancel
ru: Отмена

source: Navigate
ru: Переход

source: Go to Grails Con&troller
ru: П&ерейти к контроллеру Grails

source: Go to Grails Domain class
ru: Перейти к доменному классу Grails

source: Go to Grails Vi&ew
ru: Перейти к &представлению Grails

source: There was a problem creating the grails process:
ru: При создании процесса grails произошла ошибка:

source: Generate All
ru: Создать всё

source: Generate Views
ru: Создать представления

source: Grails Plugins...
ru: Плагины Grails...

source: Close
ru: Закрыть

source: Grails Plugins
ru: Плагины Grails

source: <html>The Grails Home has not been set.<br>Use menu <b>Tools/Options/Groovy</b> to set the environment.
ru: <html>Не установлено расположение Grails.<br>Используйте меню <b>Инструменты | Настройки | Groovy</b> для установки.

source: Resolve Plugins
ru: Определить плагины

source: Run Grails Command...
ru: Выполнить команду Grails...

source: Resolving Project Plugins ...
ru: Определение плагинов проекта...

source: Resolving Project Plugins
ru: Определение плагинов проекта

source: Grails Command Chooser
ru: Выбор команды Grails

source: &Debug
ru: Отла&дить

source: &Matching Tasks:
ru: Подходящие &команды:

source: <There is no command matching the current filter>
ru: <Не найдено ни одной команды, удовлетворяющей фильтру>

source: (part of command name, wildcards: "?", "*")
ru: (часть имени команды, спецсимволы: "?", "*")

source: &Filter:
ru: &Фильтр:

source: Refreshes Grails commands
ru: Обновляет список команд Grails

source: &Refresh Commands
ru: &Обновить команды

source: Reloading Grails commands...
ru: Перезагрузка команд Grails...

source: Runs selected Grails command
ru: Выполняет выбранную команду Grails

source: Run
ru: Выполнить

source: &Parameters:
ru: &Параметры:

source: Run Grails Command ({0})
ru: Выполнение команды Grails ({0})

source: Installing {0} plugin
ru: Установка плагина {0}

source: Uninstalling {0} plugin
ru: Удаление плагина {0}

source: Installing plugins
ru: Установка плагинов

source: Uninstalling plugins
ru: Удаление плагинов

source: Plugin
ru: Плагин

source: This module allows to open any existing Grails application in NetBeans.
ru: Данный модуль позволяет открыть существующее приложение Grails в NetBeans.

source: It also allows to create new one.
ru: Он также позволяет создать новое приложение.

source: It has support for creation of all Grails elements together with support for running the application.
ru: Он содержит поддержку создания всех элементов Grails, а также поддержку выполнения приложения.

source: No NetBeans metadata is written into application directory.
ru: Никакие метаданные NetBeans не записываются в папку приложения.

source: Grails Project
ru: Проект Grails

source: Support for Grails projects
ru: Поддержка проектов Grails

source: Creates a new controller.
ru: Создаёт контроллер.

source: The Grails Projects.
ru: Проекты Grails.

source: Creates a new domain class.
ru: Создаёт доменный класс.

source: Creates a new and empty Grails application by running "grails create-app" in the IDE and opening the application that is generated as a result.
ru: Создаёт пустое приложение Grails с помощью команды "grails create-app" и открывает созданное приложение в интегрированной среде.

source: Creates a Grails Gant Script.
ru: Создаёт скрипт Grails Gant.

source: Creates a new Grails integration test which loads the whole Grails environment when run.
ru: Создаёт интеграционный тест Grails, который загружает полное окружение Grails при выполнении.

source: Creates a new service class.
ru: Создаёт сервис.

source: Creates a new tag library.
ru: Создаёт библиотеку тегов.

source: Creates a new Grails unit test.
ru: Создаёт модульный тест Grails.

source: A unit test requires that you mock out access to dynamic methods, but executes a lot quicker.
ru: В модульном тесте вам необходимо будет имитировать динамические методы, однако модульный тест выполняется намного быстрее.

source: Name and Location
ru: Имя и расположение

source: Pac&kage:
ru: Пак&ет:

source: Artifact &Name:
ru: Имя &артефакта:

source: Package &Name:
ru: &Имя пакета:

source: Please Wait...
ru: Подождите, пожалуйста...

source: &Created File:
ru: &Созданный файл:

source: &Created Folder:
ru: &Созданная папка:

source: &Project:
ru: &Проект:

source: New
ru: Создать

source: The Package Name is not valid
ru: Имя пакета неверно

source: The Artifact Name is not valid
ru: Имя артефакта неверно

source: Warning: It is highly recommended that you do NOT place Java classes in the default package.
ru: Внимание: Настойчиво рекомендуется НЕ помещать классы Java в пакет по умолчанию.

source: The Package is not a folder
ru: Данный пакет не является папкой

source: Provide valid Artifact name
ru: Введите допустимое имя артефакта

source: The target folder does not exist.
ru: Целевая папка не существует.

source: The target folder is read-only.
ru: Целевая папка доступна только для чтения.

source: The file {0} already exists.
ru: Файл {0} уже существует.

source: <html>File {0} already exists.
ru: <html>Файл {0} уже существует.

source: Do you want to overwrite it?</html>
ru: Перезаписать?</html>

source: N/A
ru: не доступно

source: <html>Unexpected error occurred while creating the artifact.
ru: <html>При создании артефакта возникла неожиданная ошибка!

source: See output window for more details.</html>
ru: Детали находятся в окне вывода.</html>

source: Please wait...
ru: Подождите, пожалуйста...

source: Fetching list of plugins from server
ru: Получение списка плагинов с сервера

source: &Reload Plugins
ru: &Перезагрузить список плагинов

source: &Uninstall
ru: У&далить

source: &Install
ru: &Установить

source: &Browse...
ru: &Обзор...

source: Plugin &Location
ru: &Расположение плагина

source: Installed Plugins
ru: Установленные плагины

source: Available Plugins
ru: Доступные плагины

source: Reload Plugins
ru: Перезагрузить список плагинов

source: Plugin Location
ru: Расположение плагина

source: Plugins installed in the project
ru: Плагины, установленные в проекте

source: Plugins available for the project
ru: Плагины, доступные проекту

source: Reload installed plugins
ru: Обновить список установленных плагинов

source: Reload available plugins
ru: Обновить список доступных плагинов

source: Browse for plugin
ru: Выбор плагина на диске

source: Plugin file location
ru: Расположение файла плагина

source: New plugins
ru: Новые плагины

source: Installed
ru: Установленный

source: Build
ru: Построить

source: Debug
ru: Отладка

source: Test
ru: Тестирование

source: Clean
ru: Очистить

source: Grails Shell
ru: Командная строка Grails

source: Compile
ru: Компилировать

source: Statistics
ru: Статистика

source: Upgrade
ru: Обновить

source: Browse Plugin Location
ru: Выбор расположения плагина

source: Create new controller
ru: Создать контроллер

source: Create new Domain Class
ru: Создать доменный класс

source: Create a new Command Script
ru: Создать командный скрипт

source: Create a new Service
ru: Создать сервис

source: Create new Tag Library
ru: Создать библиотеку тегов

source: Name is not a valid Java package.
ru: Имя не является правильным пакетом Java.

source: &Internet Explorer (Windows only)
ru: &Internet Explorer (только для Windows)

source: No supported client-side debugging browsers are configured in the IDE
ru: В интегрированной среде не установлено ни одного браузера, поддерживающего отладку на стороне клиента.

source: Debug Grails Application (Client Side)
ru: Отладить приложение Grails (на стороне клиента)

source: Server Port:
ru: Порт сервера:

source: Active Grails Environment:
ru: Активное окружение Grails:

source: Project Folder:
ru: Папка проекта:

source: Development
ru: Разработка

source: &Java Platform:
ru: Платф&орма Java:

source: &Manage Platforms...
ru: &Управление платформами...

source: Opens the Java Platform Manager.
ru: Открывает менеджер платформ Java.

source: General Settings
ru: Общие параметры

source: Available on Windows only
ru: Доступно только для Windows

source: Display &Browser on Run
ru: Открывать &браузер при выполнении

source: &VM Options:
ru: Пара&метры VM:

source: (e.g. -Xms10m)
ru: (например, -Xms10m)

source: Grails Application
ru: Приложение Grails

source: Grails Domain Class
ru: Доменный класс Grails

source: Grails Controller
ru: Контроллер Grails

source: Grails Integration Test
ru: Интеграционный тест Grails

source: Grails Gant Script
ru: Скрипт Grails Gant.

source: Grails Service
ru: Сервис Grails

source: Grails Tag Library
ru: Библиотека тегов Grails

source: Grails Unit Test
ru: Модульный тест Grails

source: Choose File Type
ru: Выбор типа файла

source: Create Skeleton Project
ru: Создать скелет проекта

source: {0} of {1}
ru: {0} из {1}

source: <html>Unexpected error occurred while creating the application.
ru: <html>При создании приложения возникла неожиданная ошибка.

source: Select Project Location
ru: Выбор расположения проекта

source: Grails Server Output:
ru: Вывод сервера Grails:

source: Please setup your Grails Home in IDE Options
ru: Укажите папку установки Grails в настройках интегрированной среды

source: Project Location
ru: Расположение проекта

source: Project Name
ru: Имя проекта

source: Project Folder
ru: Папка проекта

source: Browse Project Location
ru: Выбор расположения проекта

source: Set as Main Project
ru: Сделать главным проектом

source: New Project Location
ru: Расположение нового проекта

source: Project
ru: Проект

source: Created file
ru: Созданный файл

source: Class name
ru: Имя класса

source: Creating artifact
ru: Создание артефакта

source: Created File
ru: Созданный файл

source: Class Name
ru: Имя класса

source: Project Name is empty
ru: Пустое имя проекта

source: Project Location is not a directory
ru: Расположение проекта не является папкой

source: Folder already exists
ru: Папка проекта уже существует

source: Provide valid class name
ru: Введите допустимое имя класса

source: File already exists
ru: Файл уже существует

source: Project &Location:
ru: &Расположение проекта:

source: Project &Name:
ru: &Имя проекта:

source: Project Fol&der:
ru: &Папка проекта:

source: Br&owse...
ru: Об&зор...

source: Configure &Grails...
ru: &Настроить Grails...

source: Set as &Main Project
ru: Сделать &главным проектом

source: GSP Editor
ru: Редактор GSP

source: Embedded Groovy (GSP) Files
ru: Файлы серверных страниц Groovy (GSP)

source: This module adds support for Groovy Server Pages (GSP) like syntax highlighting, formatting.
ru: Данный модуль добавляет поддержку серверных страниц Groovy (GSP) и поддерживает подсветку синтаксиса, форматирование,

source: etc...
ru: и т. п.

source: Groovy Server Pages
ru: Серверные страницы Groovy

source: Unfinished tag.
ru: Незаконченный тег.

source: Unpaired end tag.
ru: Конечный тег без пары.

source: Unexpected character.
ru: Неожиданный символ.

source: Support for Groovy Server Pages (GSP)
ru: Поддержка серверных страниц Groovy (GSP)

source: Gsp Files
ru: Файлы GSP

source: GSP File
ru: Файл GSP

source: Groovy Server Pages (GSP)
ru: Серверные страницы Groovy (GSP)

source: Groovy Delimiter
ru: Ограничитель Groovy

source: Comment
ru: Комментарий

source: GSP Tag
ru: Тег GSP

source: HTML Whitespace
ru: Пробел в коде HTML

source: HTML Tag
ru: Тег HTML

source: HTML Attribute of a Tag
ru: Атрибут тега HTML

source: HTML Comment
ru: Комментарий HTML

source: HTML Text
ru: Текст HTML

source: HTML Character Reference
ru: Ссылка на символ HTML

source: HTML Operator
ru: Оператор HTML

source: HTML Error
ru: Ошибка HTML

source: HTML Attribute Value
ru: Значение атрибута HTML

source: SGML Declaration
ru: Объявление SGML

source: SGML Comment
ru: Комментарий SGML

source: Scripting language
ru: Скриптовый язык

source: Java Whitespace
ru: Пробел в коде Java

source: Java Error
ru: Ошибка в коде Java

source: Java Identifier
ru: Идентификатор Java

source: Java Line Comment
ru: Однострочный комментарий Java

source: Java Block Comment
ru: Блочный комментарий Java

source: Java Operator
ru: Оператор Java

source: Java Char
ru: Символ Java

source: Java Annotation
ru: Аннотация Java

source: Java String
ru: Строка Java

source: Java Number
ru: Число Java

source: Java Keyword
ru: Ключевое слово Java

source: Java Method Call
ru: Вызов метода Java

source: Text
ru: Текст

source: Tag
ru: Тег

source: Symbol
ru: Символ

source: Tag Directive
ru: Директива тега

source: JSP Scriptlet
ru: Скриптлет JSP

source: Expression Language
ru: Язык выражений

source: Attribute Name
ru: Имя атрибута

source: Attribute Value
ru: Значение атрибута

source: Attribute Whitespace
ru: Пробел в атрибуте

source: JSP Scriptlet Delimiter
ru: Ограничитель скриптлета JSP

source: Java keyword
ru: Ключевое слово Java

source: Java Character Literal
ru: Символьный литерал Java

source: JSP Attribute Value
ru: Значение атрибута JSP

source: JSP Comment
ru: Комментарий JSP

source: JSP Tag Error
ru: Ошибка в теге JSP

source: JSP Whitespace
ru: Пробел в коде JSP

source: JSP Text
ru: Текст JSP

source: JSP Symbol
ru: Символ JSP

source: JSP Attribute Name
ru: Имя атрибута JSP

source: JSP Tag/Directive
ru: Тег/директива JSP

source: Scriptlet Delimiter
ru: Ограничитель скриптлета

source: XML DOCTYPE Declaration
ru: Декларация XML DOCTYPE

source: XML Operator
ru: Оператор XML

source: XML EOL
ru: Конец строки XML

source: XML CDATA Section
ru: Секция XML CDATA

source: XML Markup Whitespace
ru: Пробел разметки XML

source: XML Value
ru: Значение атрибута XML

source: XML Reference
ru: Ссылка XML

source: XML Error
ru: Ошибка XML

source: XML Attribute
ru: Атрибут XML

source: XML Tag
ru: Тег XML

source: XML Comment
ru: Комментарий XML

source: XML Text
ru: Текст XML

source: XML PI Start
ru: Начало XML PI

source: XML PI Content
ru: Содержимое XML PI

source: XML PI Target
ru: Цель XML PI

source: XML PI End
ru: Конец XML PI

source: JSP Formated Text
ru: Форматированный текст JSP

source: EL EOL
ru: Конец строки языка выражений

source: EL Whitespace
ru: Пробел языка выражений

source: EL Scriptlet Delimiter
ru: Ограничитель скриптлета языка выражений

source: EL Error In Sources
ru: Ошибка языка выражений в исходном тексте

source: EL Identifier
ru: Идентификатор языка выражений

source: EL function call
ru: Вызов функции языка выражений

source: EL Keyword
ru: Ключевое слово языка выражений

source: EL Operator
ru: Оператор языка выражений

source: EL Tag Library Prefix
ru: Префикс библиотеки тегов языка выражений

source: EL String Literal
ru: Строковый литерал языка выражений

source: EL Numeric Literal
ru: Числовой литерал языка выражений

source: EL Character Literal
ru: Литерал символа языка выражений

source: EL Operators
ru: Операторы языка выражений

source: Ruby Error
ru: Ошибка Ruby

source: Ruby Class Variable
ru: Переменная класса Ruby

source: Ruby Regular Expression
ru: Регулярное выражение Ruby

source: Ruby Line Comment
ru: Однострочный комментарий Ruby

source: Ruby Constant
ru: Константа Ruby

source: Ruby Number
ru: Число Ruby

source: Ruby Identifier
ru: Идентификатор Ruby

source: Ruby Keyword
ru: Ключевое слово Ruby

source: Ruby Whitespace
ru: Пробел в коде Ruby

source: Ruby Floating point number
ru: Число с плавающей точкой Ruby

source: Ruby Operator
ru: Оператор Ruby

source: Ruby Instance
ru: Экземпляр Ruby

source: Ruby Invalid String
ru: Неверная строка Ruby

source: Ruby Global Variable
ru: Глобальная переменная Ruby

source: Ruby Todo Item
ru: Задача (элемент TODO) Ruby

source: Ruby String
ru: Строка Ruby

source: Ruby Double
ru: Число с плавающей точкой двойной точности Ruby

source: Ruby Block Comment
ru: Блочный комментарий Ruby

source: Ruby Quoted String
ru: Строка в кавычках Ruby

source: Ruby Long
ru: Длинное целое Ruby

source: Ruby String Escape
ru: Последовательность спецсимволов Ruby

source: Ruby Character Literal
ru: Символьный литерал Ruby

source: Ruby Documentation
ru: Документация Ruby

source: Creates a new GSP (GroovyServer Pages) file.
ru: Создаёт новую серверную страницу Groovy (GSP).

source: This module provides all Groovy and Grails functionality available in NetBeans.
ru: Данный модуль предоставляет поддержку всей функциональности Groovy и Grails, доступную в NetBeans.

source: It is wrapper for all single modules in this area.
ru: Это обёртка всех модулей данной функциональности.

source: Groovy and Grails
ru: Groovy и Grails
